thesis-metrics/linkerd_rps100/k6_linkerd8_rps100_summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: permutation-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
              * constant_load: 100.00 iterations/s for 30s (maxVUs: 25-200, gracefulStop: 30s)


running (0m01.0s), 001/025 VUs, 99 complete and 0 interrupted iterations
constant_load   [   3% ] 001/025 VUs  01.0s/30s  100.00 iters/s

running (0m02.0s), 000/025 VUs, 200 complete and 0 interrupted iterations
constant_load   [   7% ] 000/025 VUs  02.0s/30s  100.00 iters/s

running (0m03.0s), 001/025 VUs, 299 complete and 0 interrupted iterations
constant_load   [  10% ] 001/025 VUs  03.0s/30s  100.00 iters/s

running (0m04.0s), 001/025 VUs, 399 complete and 0 interrupted iterations
constant_load   [  13% ] 001/025 VUs  04.0s/30s  100.00 iters/s

running (0m05.0s), 001/025 VUs, 499 complete and 0 interrupted iterations
constant_load   [  17% ] 001/025 VUs  05.0s/30s  100.00 iters/s

running (0m06.0s), 001/025 VUs, 599 complete and 0 interrupted iterations
constant_load   [  20% ] 001/025 VUs  06.0s/30s  100.00 iters/s

running (0m07.0s), 001/025 VUs, 699 complete and 0 interrupted iterations
constant_load   [  23% ] 001/025 VUs  07.0s/30s  100.00 iters/s

running (0m08.0s), 001/025 VUs, 799 complete and 0 interrupted iterations
constant_load   [  27% ] 001/025 VUs  08.0s/30s  100.00 iters/s

running (0m09.0s), 001/025 VUs, 899 complete and 0 interrupted iterations
constant_load   [  30% ] 001/025 VUs  09.0s/30s  100.00 iters/s

running (0m10.0s), 001/025 VUs, 999 complete and 0 interrupted iterations
constant_load   [  33% ] 001/025 VUs  10.0s/30s  100.00 iters/s

running (0m11.0s), 001/025 VUs, 1099 complete and 0 interrupted iterations
constant_load   [  37% ] 001/025 VUs  11.0s/30s  100.00 iters/s

running (0m12.0s), 001/025 VUs, 1199 complete and 0 interrupted iterations
constant_load   [  40% ] 001/025 VUs  12.0s/30s  100.00 iters/s

running (0m13.0s), 001/025 VUs, 1299 complete and 0 interrupted iterations
constant_load   [  43% ] 001/025 VUs  13.0s/30s  100.00 iters/s

running (0m14.0s), 001/025 VUs, 1399 complete and 0 interrupted iterations
constant_load   [  47% ] 001/025 VUs  14.0s/30s  100.00 iters/s

running (0m15.0s), 001/025 VUs, 1499 complete and 0 interrupted iterations
constant_load   [  50% ] 001/025 VUs  15.0s/30s  100.00 iters/s

running (0m16.0s), 001/025 VUs, 1599 complete and 0 interrupted iterations
constant_load   [  53% ] 001/025 VUs  16.0s/30s  100.00 iters/s

running (0m17.0s), 001/025 VUs, 1699 complete and 0 interrupted iterations
constant_load   [  57% ] 001/025 VUs  17.0s/30s  100.00 iters/s

running (0m18.0s), 001/025 VUs, 1799 complete and 0 interrupted iterations
constant_load   [  60% ] 001/025 VUs  18.0s/30s  100.00 iters/s

running (0m19.0s), 001/025 VUs, 1899 complete and 0 interrupted iterations
constant_load   [  63% ] 001/025 VUs  19.0s/30s  100.00 iters/s

running (0m20.0s), 001/025 VUs, 1999 complete and 0 interrupted iterations
constant_load   [  67% ] 001/025 VUs  20.0s/30s  100.00 iters/s

running (0m21.0s), 001/025 VUs, 2099 complete and 0 interrupted iterations
constant_load   [  70% ] 001/025 VUs  21.0s/30s  100.00 iters/s

running (0m22.0s), 001/025 VUs, 2199 complete and 0 interrupted iterations
constant_load   [  73% ] 001/025 VUs  22.0s/30s  100.00 iters/s

running (0m23.0s), 001/025 VUs, 2299 complete and 0 interrupted iterations
constant_load   [  77% ] 001/025 VUs  23.0s/30s  100.00 iters/s

running (0m24.0s), 001/025 VUs, 2399 complete and 0 interrupted iterations
constant_load   [  80% ] 001/025 VUs  24.0s/30s  100.00 iters/s

running (0m25.0s), 001/025 VUs, 2499 complete and 0 interrupted iterations
constant_load   [  83% ] 001/025 VUs  25.0s/30s  100.00 iters/s

running (0m26.0s), 001/025 VUs, 2599 complete and 0 interrupted iterations
constant_load   [  87% ] 001/025 VUs  26.0s/30s  100.00 iters/s

running (0m27.0s), 001/025 VUs, 2699 complete and 0 interrupted iterations
constant_load   [  90% ] 001/025 VUs  27.0s/30s  100.00 iters/s

running (0m28.0s), 001/025 VUs, 2799 complete and 0 interrupted iterations
constant_load   [  93% ] 001/025 VUs  28.0s/30s  100.00 iters/s

running (0m29.0s), 001/025 VUs, 2899 complete and 0 interrupted iterations
constant_load   [  97% ] 001/025 VUs  29.0s/30s  100.00 iters/s

running (0m30.0s), 001/025 VUs, 2999 complete and 0 interrupted iterations
constant_load   [ 100% ] 001/025 VUs  30.0s/30s  100.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 3000    99.997408/s
    checks_succeeded...: 100.00% 3000 out of 3000
    checks_failed......: 0.00%   0 out of 3000

    ✓ is status 200

    HTTP
    http_req_duration..............: avg=4.85ms min=3.14ms med=4.48ms max=17.97ms p(90)=6.69ms p(95)=6.85ms
      { expected_response:true }...: avg=4.85ms min=3.14ms med=4.48ms max=17.97ms p(90)=6.69ms p(95)=6.85ms
    http_req_failed................: 0.00%  0 out of 3000
    http_reqs......................: 3000   99.997408/s

    EXECUTION
    iteration_duration.............: avg=4.97ms min=3.22ms med=4.6ms  max=18.23ms p(90)=6.8ms  p(95)=6.99ms
    iterations.....................: 3000   99.997408/s
    vus............................: 1      min=0         max=1 
    vus_max........................: 25     min=25        max=25

    NETWORK
    data_received..................: 1.6 MB 52 kB/s
    data_sent......................: 534 kB 18 kB/s



running (0m30.0s), 000/025 VUs, 3000 complete and 0 interrupted iterations
constant_load ✓ [ 100% ] 000/025 VUs  30s  100.00 iters/s